#low2_3_tag1
layer {
  name: "low2_3_tag1"
  type : "Data"
  bottom: "up2_2_tag1"
  bottom: "up1_3_tag1"
  top: "low2_3_tag1"
  data_param {
    DB_backend : LEVEL_DB
  }
  transform_param {
    scale : 1
    mirror : "false"
    multiscale : "false"
  }
}

