layer {
  name: "data"
  type: "CPMData"
  top: "data"
  top: "label"
  transform_param {
    stride: 8
    max_rotate_degree: 40
    crop_size_x: 277
    crop_size_y: 277
    scale_prob: 1
    scale_min: 0.7
    scale_max: 1.3
    target_dist: 1.171
    center_perterb_max: 0
    do_clahe: false
  }
  cpmdata_param {
    source: "lmdb/MPI_validation"
    batch_size: 16
    backend: LMDB
  }
}
layer {
  name: "image"
  type: "Slice"
  bottom: "data"
  top: "image"
  top: "center_map"
  slice_param {
    slice_point: 3
    axis: 1
  }
}
layer {
  name: "label_lower"
  type: "Slice"
  bottom: "label"
  top: "label_lower"
  top: "label_1st_lower"
  slice_param {
    slice_point: 15
    axis: 1
  }
}
#cnv1_
layer {
name: "cnv1_"
type: "Convolution"
bottom: "center_map"
top: "cnv1_"
# learning rate and decay multipliers for the filters
param { lr_mult: 1 decay_mult: 1 }
# learning rate and decay multipliers for the biases
param { lr_mult: 2 decay_mult: 0 }
convolution_param {
num_output: 64     # learn 64 filters
kernel_size: 7    # each filter is 7x7
stride: 2
pad: 3          # step 2 pixels between each filter application
weight_filler {
type: "gaussian" # initialize the filters from a Gaussian
std: 0.01        # distribution with stdev 0.01 (default mean: 0)
}
bias_filler {
type: "constant" # initialize the biases to zero (0)
value: 0
}
}
}
#cnv1

layer {
name: "BatchNorm_cnv1"
type: "BatchNorm"
bottom: "cnv1_"
top: "BatchNorm_cnv1"
param {
lr_mult: 0
}
param {
lr_mult: 0
}
param {
lr_mult: 0
}
}
layer {
name: "Relu_cnv1"
type: "ReLU"
bottom: "BatchNorm_cnv1"
top: "cnv1"
}
#r1
#batchnorm1_r1
layer {
name : "BN1_r1"
type: "BatchNorm"
batch_norm_param {

}
top : "BN1_r1"
bottom: "cnv1"
}
#relu1_r1
layer {
name : "ReLU1_r1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_r1"
bottom : "BN1_r1"
}
#conv1_r1
layer {
name : "Convolution1_r1"
type : "Convolution"
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2 
decay_mult : 0
}
convolution_param {
num_output: 64
kernel_size: 1    
stride: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
top : "Convolution1_r1"
bottom : "ReLU1_r1"
}
#batchnorm2_r1
layer {
name : "BN2_r1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_r1"
bottom : "Convolution1_r1"
}
#relu2_r1
layer {
name : "ReLU2_r1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_r1"
bottom : "BN2_r1"
}
#conv2_r1
layer {
name : "Convolution2_r1"
type : "Convolution"
convolution_param {
num_output: 64
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}

}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}
top : "Convolution2_r1"
bottom : "ReLU2_r1"
}
#batchnorm3_r1
layer {
name : "BN3_r1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_r1"
bottom : "Convolution2_r1"
}
#relu3_r1
layer {
name : "ReLU3_r1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_r1"
bottom : "BN3_r1"
}
#conv3_r1
layer {
name : "Convolution3_r1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}
top : "Convolution3_r1"
bottom : "ReLU3_r1"
}
#conv4_r1
layer {
name : "Convolution4_r1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}

}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}
top : "Convolution4_r1"
bottom : "cnv1"
}
#out_r1
layer {
name : "out_r1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0
}
top : "r1"
bottom : "Convolution3_r1"
bottom : "Convolution4_r1"
}
#pool
layer {
name: "pool"
type: "Pooling"
bottom : "r1"
top: "pool"
pooling_param {
pool: MAX
kernel_size: 2
stride: 2
}
}
#r4
#batchnorm1_r4
layer {
name : "BN1_r4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_r4"
bottom: "pool"
}
#relu1_r4
layer {
name : "ReLU1_r4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_r4"
bottom : "BN1_r4"
}
#conv1_r4
layer {
name : "Convolution1_r4"
type : "Convolution"
convolution_param {
num_output: 64
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}

}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}
top : "Convolution1_r4"
bottom : "ReLU1_r4"
}
#batchnorm2_r4
layer {
name : "BN2_r4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_r4"
bottom : "Convolution1_r4"
}
#relu2_r4
layer {
name : "ReLU2_r4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_r4"
bottom : "BN2_r4"
}
#conv2_r4
layer {
name : "Convolution2_r4"
type : "Convolution"
convolution_param {
num_output: 64
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}
top : "Convolution2_r4"
bottom : "ReLU2_r4"
}
#batchnorm3_r4
layer {
name : "BN3_r4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_r4"
bottom : "Convolution2_r4"
}
#relu3_r4
layer {
name : "ReLU3_r4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_r4"
bottom : "BN3_r4"
}
#conv3_r4
layer {
name : "Convolution3_r4"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}

}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}
top : "Convolution3_r4"
bottom : "ReLU3_r4"
}
#out_r4
layer {
name : "out_r4"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "r4"
bottom : "Convolution3_r4"
bottom : "pool"
}
#r5
#batchnorm1_r5
layer {
name : "BN1_r5"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_r5"
bottom: "r4"
}
#relu1_r5
layer {
name : "ReLU1_r5"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_r5"
bottom : "BN1_r5"
}
#conv1_r5
layer {
name : "Convolution1_r5"
type : "Convolution"
convolution_param {
num_output: 64
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}

}
top : "Convolution1_r5"
bottom : "ReLU1_r5"

param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}
}
#batchnorm2_r5
layer {
name : "BN2_r5"
type: "BatchNorm"
batch_norm_param {

}
top : "BN2_r5"
bottom : "Convolution1_r5"
}
#relu2_r5
layer {
name : "ReLU2_r5"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_r5"
bottom : "BN2_r5"
}
#conv2_r5
layer {
name : "Convolution2_r5"
type : "Convolution"
convolution_param {
num_output: 64
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_r5"
bottom : "ReLU2_r5"
}
#batchnorm3_r5
layer {
name : "BN3_r5"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_r5"
bottom : "Convolution2_r5"
}
#relu3_r5
layer {
name : "ReLU3_r5"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_r5"
bottom : "BN3_r5"
}
#conv3_r5
layer {
name : "Convolution3_r5"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_r5"
bottom : "ReLU3_r5"
}
#conv4_r5
layer {
name : "Convolution4_r5"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution4_r5"
bottom : "r4"
}
#out_r5
layer {
name : "out_r5"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "r5"
bottom : "Convolution3_r5"
bottom : "Convolution4_r5"
}
#loop1
#inter_loop1
layer {
name : "inter_loop1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inter_loop1"
bottom : "r5"
}
#hg_loop1
#inp_loop1
layer {
name : "inp_loop1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop1"
bottom: "inter_loop1"
}
#up1_1_loop1
#inp_loop1_up1_1
layer {
name : "inp_loop1_up1_1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop1_up1_1"
bottom: "inp_loop1"
}
#batchnorm1_loop1_up1_1
layer {
name : "BN1_loop1_up1_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_up1_1"
bottom: "inp_loop1_up1_1"
}
#relu1_loop1_up1_1
layer {
name : "ReLU1_loop1_up1_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_up1_1"
bottom : "BN1_loop1_up1_1"
}
#conv1_loop1_up1_1
layer {
name : "Convolution1_loop1_up1_1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_up1_1"
bottom : "ReLU1_loop1_up1_1"
}
#batchnorm2_loop1_up1_1
layer {
name : "BN2_loop1_up1_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_up1_1"
bottom : "Convolution1_loop1_up1_1"
}
#relu2_loop1_up1_1
layer {
name : "ReLU2_loop1_up1_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_up1_1"
bottom : "BN2_loop1_up1_1"
}
#conv2_loop1_up1_1
layer {
name : "Convolution2_loop1_up1_1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_up1_1"
bottom : "ReLU2_loop1_up1_1"
}
#batchnorm3_loop1_up1_1
layer {
name : "BN3_loop1_up1_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_up1_1"
bottom : "Convolution2_loop1_up1_1"
}
#relu3_loop1_up1_1
layer {
name : "ReLU3_loop1_up1_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_up1_1"
bottom : "BN3_loop1_up1_1"
}
#conv3_loop1_up1_1
layer {
name : "Convolution3_loop1_up1_1"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_up1_1"
bottom : "ReLU3_loop1_up1_1"
}
#out_loop1_up1_1
layer {
name : "out_loop1_up1_1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "up1_1_loop1"
bottom : "Convolution3_loop1_up1_1"
bottom : "inp_loop1_up1_1"
}
#low1_pooling_1_loop1
layer {
name: "low1_pooling_1_loop1"
type: "Pooling"
bottom : "up1_1_loop1"
top: "low1_pooling_1_loop1"
pooling_param {
pool: MAX
kernel_size: 2
stride: 2
}
}
#low1_1_loop1
#batchnorm1_loop1_low1_1
layer {
name : "BN1_loop1_low1_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_low1_1"
bottom: "low1_pooling_1_loop1"
}
#relu1_loop1_low1_1
layer {
name : "ReLU1_loop1_low1_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_low1_1"
bottom : "BN1_loop1_low1_1"
}
#conv1_loop1_low1_1
layer {
name : "Convolution1_loop1_low1_1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_low1_1"
bottom : "ReLU1_loop1_low1_1"
}
#batchnorm2_loop1_low1_1
layer {
name : "BN2_loop1_low1_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_low1_1"
bottom : "Convolution1_loop1_low1_1"
}
#relu2_loop1_low1_1
layer {
name : "ReLU2_loop1_low1_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_low1_1"
bottom : "BN2_loop1_low1_1"
}
#conv2_loop1_low1_1
layer {
name : "Convolution2_loop1_low1_1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_low1_1"
bottom : "ReLU2_loop1_low1_1"
}
#batchnorm3_loop1_low1_1
layer {
name : "BN3_loop1_low1_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_low1_1"
bottom : "Convolution2_loop1_low1_1"
}
#relu3_loop1_low1_1
layer {
name : "ReLU3_loop1_low1_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_low1_1"
bottom : "BN3_loop1_low1_1"
}
#conv3_loop1_low1_1
layer {
name : "Convolution3_loop1_low1_1"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_low1_1"
bottom : "ReLU3_loop1_low1_1"
}
#out_loop1_low1_1
layer {
name : "out_loop1_low1_1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "low1_1_loop1"
bottom : "Convolution3_loop1_low1_1"
bottom : "low1_pooling_1_loop1"
}
#up1_2_loop1
#inp_loop1_up1_2
layer {
name : "inp_loop1_up1_2"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop1_up1_2"
bottom: "low1_1_loop1"
}
#batchnorm1_loop1_up1_2
layer {
name : "BN1_loop1_up1_2"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_up1_2"
bottom: "inp_loop1_up1_2"
}
#relu1_loop1_up1_2
layer {
name : "ReLU1_loop1_up1_2"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_up1_2"
bottom : "BN1_loop1_up1_2"
}
#conv1_loop1_up1_2
layer {
name : "Convolution1_loop1_up1_2"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_up1_2"
bottom : "ReLU1_loop1_up1_2"
}
#batchnorm2_loop1_up1_2
layer {
name : "BN2_loop1_up1_2"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_up1_2"
bottom : "Convolution1_loop1_up1_2"
}
#relu2_loop1_up1_2
layer {
name : "ReLU2_loop1_up1_2"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_up1_2"
bottom : "BN2_loop1_up1_2"
}
#conv2_loop1_up1_2
layer {
name : "Convolution2_loop1_up1_2"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_up1_2"
bottom : "ReLU2_loop1_up1_2"
}
#batchnorm3_loop1_up1_2
layer {
name : "BN3_loop1_up1_2"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_up1_2"
bottom : "Convolution2_loop1_up1_2"
}
#relu3_loop1_up1_2
layer {
name : "ReLU3_loop1_up1_2"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_up1_2"
bottom : "BN3_loop1_up1_2"
}
#conv3_loop1_up1_2
layer {
name : "Convolution3_loop1_up1_2"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_up1_2"
bottom : "ReLU3_loop1_up1_2"
}
#out_loop1_up1_2
layer {
name : "out_loop1_up1_2"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "up1_2_loop1"
bottom : "Convolution3_loop1_up1_2"
bottom : "inp_loop1_up1_2"
}
#low1_pooling_2_loop1
layer {
name: "low1_pooling_2_loop1"
type: "Pooling"
bottom : "up1_2_loop1"
top: "low1_pooling_2_loop1"
pooling_param {
pool: MAX
kernel_size: 2
stride: 2
}
}
#low1_2_loop1
#batchnorm1_loop1_low1_2
layer {
name : "BN1_loop1_low1_2"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_low1_2"
bottom: "low1_pooling_2_loop1"
}
#relu1_loop1_low1_2
layer {
name : "ReLU1_loop1_low1_2"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_low1_2"
bottom : "BN1_loop1_low1_2"
}
#conv1_loop1_low1_2
layer {
name : "Convolution1_loop1_low1_2"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_low1_2"
bottom : "ReLU1_loop1_low1_2"
}
#batchnorm2_loop1_low1_2
layer {
name : "BN2_loop1_low1_2"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_low1_2"
bottom : "Convolution1_loop1_low1_2"
}
#relu2_loop1_low1_2
layer {
name : "ReLU2_loop1_low1_2"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_low1_2"
bottom : "BN2_loop1_low1_2"
}
#conv2_loop1_low1_2
layer {
name : "Convolution2_loop1_low1_2"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_low1_2"
bottom : "ReLU2_loop1_low1_2"
}
#batchnorm3_loop1_low1_2
layer {
name : "BN3_loop1_low1_2"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_low1_2"
bottom : "Convolution2_loop1_low1_2"
}
#relu3_loop1_low1_2
layer {
name : "ReLU3_loop1_low1_2"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_low1_2"
bottom : "BN3_loop1_low1_2"
}
#conv3_loop1_low1_2
layer {
name : "Convolution3_loop1_low1_2"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_low1_2"
bottom : "ReLU3_loop1_low1_2"
}
#out_loop1_low1_2
layer {
name : "out_loop1_low1_2"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "low1_2_loop1"
bottom : "Convolution3_loop1_low1_2"
bottom : "low1_pooling_2_loop1"
}
#up1_3_loop1
#inp_loop1_up1_3
layer {
name : "inp_loop1_up1_3"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop1_up1_3"
bottom: "low1_2_loop1"
}
#batchnorm1_loop1_up1_3
layer {
name : "BN1_loop1_up1_3"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_up1_3"
bottom: "inp_loop1_up1_3"
}
#relu1_loop1_up1_3
layer {
name : "ReLU1_loop1_up1_3"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_up1_3"
bottom : "BN1_loop1_up1_3"
}
#conv1_loop1_up1_3
layer {
name : "Convolution1_loop1_up1_3"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_up1_3"
bottom : "ReLU1_loop1_up1_3"
}
#batchnorm2_loop1_up1_3
layer {
name : "BN2_loop1_up1_3"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_up1_3"
bottom : "Convolution1_loop1_up1_3"
}
#relu2_loop1_up1_3
layer {
name : "ReLU2_loop1_up1_3"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_up1_3"
bottom : "BN2_loop1_up1_3"
}
#conv2_loop1_up1_3
layer {
name : "Convolution2_loop1_up1_3"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_up1_3"
bottom : "ReLU2_loop1_up1_3"
}
#batchnorm3_loop1_up1_3
layer {
name : "BN3_loop1_up1_3"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_up1_3"
bottom : "Convolution2_loop1_up1_3"
}
#relu3_loop1_up1_3
layer {
name : "ReLU3_loop1_up1_3"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_up1_3"
bottom : "BN3_loop1_up1_3"
}
#conv3_loop1_up1_3
layer {
name : "Convolution3_loop1_up1_3"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_up1_3"
bottom : "ReLU3_loop1_up1_3"
}
#out_loop1_up1_3
layer {
name : "out_loop1_up1_3"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "up1_3_loop1"
bottom : "Convolution3_loop1_up1_3"
bottom : "inp_loop1_up1_3"
}
#low1_pooling_3_loop1
layer {
name: "low1_pooling_3_loop1"
type: "Pooling"
bottom : "up1_3_loop1"
top: "low1_pooling_3_loop1"
pooling_param {
pool: MAX
kernel_size: 2
stride: 2
}
}
#low1_3_loop1
#batchnorm1_loop1_low1_3
layer {
name : "BN1_loop1_low1_3"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_low1_3"
bottom: "low1_pooling_3_loop1"
}
#relu1_loop1_low1_3
layer {
name : "ReLU1_loop1_low1_3"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_low1_3"
bottom : "BN1_loop1_low1_3"
}
#conv1_loop1_low1_3
layer {
name : "Convolution1_loop1_low1_3"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_low1_3"
bottom : "ReLU1_loop1_low1_3"
}
#batchnorm2_loop1_low1_3
layer {
name : "BN2_loop1_low1_3"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_low1_3"
bottom : "Convolution1_loop1_low1_3"
}
#relu2_loop1_low1_3
layer {
name : "ReLU2_loop1_low1_3"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_low1_3"
bottom : "BN2_loop1_low1_3"
}
#conv2_loop1_low1_3
layer {
name : "Convolution2_loop1_low1_3"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_low1_3"
bottom : "ReLU2_loop1_low1_3"
}
#batchnorm3_loop1_low1_3
layer {
name : "BN3_loop1_low1_3"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_low1_3"
bottom : "Convolution2_loop1_low1_3"
}
#relu3_loop1_low1_3
layer {
name : "ReLU3_loop1_low1_3"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_low1_3"
bottom : "BN3_loop1_low1_3"
}
#conv3_loop1_low1_3
layer {
name : "Convolution3_loop1_low1_3"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_low1_3"
bottom : "ReLU3_loop1_low1_3"
}
#out_loop1_low1_3
layer {
name : "out_loop1_low1_3"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "low1_3_loop1"
bottom : "Convolution3_loop1_low1_3"
bottom : "low1_pooling_3_loop1"
}
#up1_4_loop1
#inp_loop1_up1_4
layer {
name : "inp_loop1_up1_4"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop1_up1_4"
bottom: "low1_3_loop1"
}
#batchnorm1_loop1_up1_4
layer {
name : "BN1_loop1_up1_4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_up1_4"
bottom: "inp_loop1_up1_4"
}
#relu1_loop1_up1_4
layer {
name : "ReLU1_loop1_up1_4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_up1_4"
bottom : "BN1_loop1_up1_4"
}
#conv1_loop1_up1_4
layer {
name : "Convolution1_loop1_up1_4"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_up1_4"
bottom : "ReLU1_loop1_up1_4"
}
#batchnorm2_loop1_up1_4
layer {
name : "BN2_loop1_up1_4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_up1_4"
bottom : "Convolution1_loop1_up1_4"
}
#relu2_loop1_up1_4
layer {
name : "ReLU2_loop1_up1_4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_up1_4"
bottom : "BN2_loop1_up1_4"
}
#conv2_loop1_up1_4
layer {
name : "Convolution2_loop1_up1_4"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_up1_4"
bottom : "ReLU2_loop1_up1_4"
}
#batchnorm3_loop1_up1_4
layer {
name : "BN3_loop1_up1_4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_up1_4"
bottom : "Convolution2_loop1_up1_4"
}
#relu3_loop1_up1_4
layer {
name : "ReLU3_loop1_up1_4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_up1_4"
bottom : "BN3_loop1_up1_4"
}
#conv3_loop1_up1_4
layer {
name : "Convolution3_loop1_up1_4"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_up1_4"
bottom : "ReLU3_loop1_up1_4"
}
#out_loop1_up1_4
layer {
name : "out_loop1_up1_4"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "up1_4_loop1"
bottom : "Convolution3_loop1_up1_4"
bottom : "inp_loop1_up1_4"
}
#low1_pooling_4_loop1
layer {
name: "low1_pooling_4_loop1"
type: "Pooling"
bottom : "up1_4_loop1"
top: "low1_pooling_4_loop1"
pooling_param {
pool: MAX
kernel_size: 2
stride: 2
}
}
#low1_4_loop1
#batchnorm1_loop1_low1_4
layer {
name : "BN1_loop1_low1_4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_low1_4"
bottom: "low1_pooling_4_loop1"
}
#relu1_loop1_low1_4
layer {
name : "ReLU1_loop1_low1_4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_low1_4"
bottom : "BN1_loop1_low1_4"
}
#conv1_loop1_low1_4
layer {
name : "Convolution1_loop1_low1_4"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_low1_4"
bottom : "ReLU1_loop1_low1_4"
}
#batchnorm2_loop1_low1_4
layer {
name : "BN2_loop1_low1_4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_low1_4"
bottom : "Convolution1_loop1_low1_4"
}
#relu2_loop1_low1_4
layer {
name : "ReLU2_loop1_low1_4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_low1_4"
bottom : "BN2_loop1_low1_4"
}
#conv2_loop1_low1_4
layer {
name : "Convolution2_loop1_low1_4"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_low1_4"
bottom : "ReLU2_loop1_low1_4"
}
#batchnorm3_loop1_low1_4
layer {
name : "BN3_loop1_low1_4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_low1_4"
bottom : "Convolution2_loop1_low1_4"
}
#relu3_loop1_low1_4
layer {
name : "ReLU3_loop1_low1_4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_low1_4"
bottom : "BN3_loop1_low1_4"
}
#conv3_loop1_low1_4
layer {
name : "Convolution3_loop1_low1_4"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_low1_4"
bottom : "ReLU3_loop1_low1_4"
}
#out_loop1_low1_4
layer {
name : "out_loop1_low1_4"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "low1_4_loop1"
bottom : "Convolution3_loop1_low1_4"
bottom : "low1_pooling_4_loop1"
}
#low2_1_loop1
#inp_loop1_low2_1
layer {
name : "inp_loop1_low2_1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop1_low2_1"
bottom: "low1_4_loop1"
}
#batchnorm1_loop1_low2_1
layer {
name : "BN1_loop1_low2_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_low2_1"
bottom: "inp_loop1_low2_1"
}
#relu1_loop1_low2_1
layer {
name : "ReLU1_loop1_low2_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_low2_1"
bottom : "BN1_loop1_low2_1"
}
#conv1_loop1_low2_1
layer {
name : "Convolution1_loop1_low2_1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_low2_1"
bottom : "ReLU1_loop1_low2_1"
}
#batchnorm2_loop1_low2_1
layer {
name : "BN2_loop1_low2_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_low2_1"
bottom : "Convolution1_loop1_low2_1"
}
#relu2_loop1_low2_1
layer {
name : "ReLU2_loop1_low2_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_low2_1"
bottom : "BN2_loop1_low2_1"
}
#conv2_loop1_low2_1
layer {
name : "Convolution2_loop1_low2_1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_low2_1"
bottom : "ReLU2_loop1_low2_1"
}
#batchnorm3_loop1_low2_1
layer {
name : "BN3_loop1_low2_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_low2_1"
bottom : "Convolution2_loop1_low2_1"
}
#relu3_loop1_low2_1
layer {
name : "ReLU3_loop1_low2_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_low2_1"
bottom : "BN3_loop1_low2_1"
}
#conv3_loop1_low2_1
layer {
name : "Convolution3_loop1_low2_1"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_low2_1"
bottom : "ReLU3_loop1_low2_1"
}
#out_low2_1_loop1
layer {
name : "out_low2_1_loop1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "low2_1_loop1"
bottom : "Convolution3_loop1_low2_1"
bottom : "inp_loop1_low2_1"
}
#low3_1_loop1
#inp_low3_1_loop1
layer {
name : "inp_loop1_low3_1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop1_low3_1"
bottom: "low2_1_loop1"
}
#batchnorm1_loop1_low3_1
layer {
name : "BN1_loop1_low3_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_low3_1"
bottom: "inp_loop1_low3_1"
}
#relu1_loop1_low3_1
layer {
name : "ReLU1_loop1_low3_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_low3_1"
bottom : "BN1_loop1_low3_1"
}
#conv1_loop1_low3_1
layer {
name : "Convolution1_loop1_low3_1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_low3_1"
bottom : "ReLU1_loop1_low3_1"
}
#batchnorm2_loop1_low3_1
layer {
name : "BN2_loop1_low3_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_low3_1"
bottom : "Convolution1_loop1_low3_1"
}
#relu2_loop1_low3_1
layer {
name : "ReLU2_loop1_low3_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_low3_1"
bottom : "BN2_loop1_low3_1"
}
#conv2_loop1_low3_1
layer {
name : "Convolution2_loop1_low3_1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_low3_1"
bottom : "ReLU2_loop1_low3_1"
}
#batchnorm3_loop1_low3_1
layer {
name : "BN3_loop1_low3_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_low3_1"
bottom : "Convolution2_loop1_low3_1"
}
#relu3_loop1_low3_1
layer {
name : "ReLU3_loop1_low3_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_low3_1"
bottom : "BN3_loop1_low3_1"
}
#conv3_loop1_low3_1
layer {
name : "Convolution3_loop1_low3_1"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_low3_1"
bottom : "ReLU3_loop1_low3_1"
}
#out_loop1_low3_1
layer {
name : "out_loop1_low3_1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "low3_1_loop1"
bottom : "Convolution3_loop1_low3_1"
bottom : "inp_loop1_low3_1"
}
#up2_1_loop1
layer {
name: "up2_1_loop1"
type: "Deconvolution"
bottom: "low3_1_loop1" 
top: "up2_1_loop1"
convolution_param {
kernel_size: 4 stride: 2
num_output: 512
pad: 1
weight_filler: { type: "bilinear" } bias_term: false
}
param { lr_mult: 0 decay_mult: 0 }
}
#low2_2_loop1
layer {
name: "low2_2_loop1"
type : "Concat"
bottom: "up1_4_loop1"
bottom: "up2_1_loop1"
top: "low2_2_loop1"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
}
#low3_2_loop1
#inp_low3_2_loop1
layer {
name : "inp_loop1_low3_2"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop1_low3_2"
bottom: "low2_2_loop1"
}
#batchnorm1_loop1_low3_2
layer {
name : "BN1_loop1_low3_2"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_low3_2"
bottom: "inp_loop1_low3_2"
}
#relu1_loop1_low3_2
layer {
name : "ReLU1_loop1_low3_2"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_low3_2"
bottom : "BN1_loop1_low3_2"
}
#conv1_loop1_low3_2
layer {
name : "Convolution1_loop1_low3_2"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_low3_2"
bottom : "ReLU1_loop1_low3_2"
}
#batchnorm2_loop1_low3_2
layer {
name : "BN2_loop1_low3_2"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_low3_2"
bottom : "Convolution1_loop1_low3_2"
}
#relu2_loop1_low3_2
layer {
name : "ReLU2_loop1_low3_2"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_low3_2"
bottom : "BN2_loop1_low3_2"
}
#conv2_loop1_low3_2
layer {
name : "Convolution2_loop1_low3_2"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_low3_2"
bottom : "ReLU2_loop1_low3_2"
}
#batchnorm3_loop1_low3_2
layer {
name : "BN3_loop1_low3_2"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_low3_2"
bottom : "Convolution2_loop1_low3_2"
}
#relu3_loop1_low3_2
layer {
name : "ReLU3_loop1_low3_2"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_low3_2"
bottom : "BN3_loop1_low3_2"
}
#conv3_loop1_low3_2
layer {
name : "Convolution3_loop1_low3_2"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_low3_2"
bottom : "ReLU3_loop1_low3_2"
}
#out_loop1_low3_2
layer {
name : "out_loop1_low3_2"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "low3_2_loop1"
bottom : "Convolution3_loop1_low3_2"
bottom : "inp_loop1_low3_2"
}
#up2_2_loop1
layer {
name: "up2_2_loop1" type: "Deconvolution"
bottom: "low3_2_loop1" top: "up2_2_loop1"
convolution_param {
kernel_size: 4 stride: 2
num_output: 512
pad: 1
weight_filler: { type: "bilinear" } bias_term: false
}
param { lr_mult: 0 decay_mult: 0 }
}
#low2_3_loop1
layer {
name: "low2_3_loop1"
type : "Concat"
bottom: "up2_2_loop1"
bottom: "up1_3_loop1"
top: "low2_3_loop1"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
}
#low3_3_loop1
#inp_low3_3_loop1
layer {
name : "inp_loop1_low3_3"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop1_low3_3"
bottom: "low2_3_loop1"
}
#batchnorm1_loop1_low3_3
layer {
name : "BN1_loop1_low3_3"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_low3_3"
bottom: "inp_loop1_low3_3"
}
#relu1_loop1_low3_3
layer {
name : "ReLU1_loop1_low3_3"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_low3_3"
bottom : "BN1_loop1_low3_3"
}
#conv1_loop1_low3_3
layer {
name : "Convolution1_loop1_low3_3"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_low3_3"
bottom : "ReLU1_loop1_low3_3"
}
#batchnorm2_loop1_low3_3
layer {
name : "BN2_loop1_low3_3"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_low3_3"
bottom : "Convolution1_loop1_low3_3"
}
#relu2_loop1_low3_3
layer {
name : "ReLU2_loop1_low3_3"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_low3_3"
bottom : "BN2_loop1_low3_3"
}
#conv2_loop1_low3_3
layer {
name : "Convolution2_loop1_low3_3"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_low3_3"
bottom : "ReLU2_loop1_low3_3"
}
#batchnorm3_loop1_low3_3
layer {
name : "BN3_loop1_low3_3"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_low3_3"
bottom : "Convolution2_loop1_low3_3"
}
#relu3_loop1_low3_3
layer {
name : "ReLU3_loop1_low3_3"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_low3_3"
bottom : "BN3_loop1_low3_3"
}
#conv3_loop1_low3_3
layer {
name : "Convolution3_loop1_low3_3"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_low3_3"
bottom : "ReLU3_loop1_low3_3"
}
#out_loop1_low3_3
layer {
name : "out_loop1_low3_3"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "low3_3_loop1"
bottom : "Convolution3_loop1_low3_3"
bottom : "inp_loop1_low3_3"
}
#up2_3_loop1
layer {
name: "up2_3_loop1" type: "Deconvolution"
bottom: "low3_3_loop1" top: "up2_3_loop1"
convolution_param {
kernel_size: 4 stride: 2
num_output: 512
pad: 1
weight_filler: { type: "bilinear" } bias_term: false
}
param { lr_mult: 0 decay_mult: 0 }
}
#low2_4_loop1
layer {
name: "low2_4_loop1"
type : "Concat"
bottom: "up2_3_loop1"
bottom: "up1_2_loop1"
top: "low2_4_loop1"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
}
#low3_4_loop1
#inp_low3_4_loop1
layer {
name : "inp_loop1_low3_4"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop1_low3_4"
bottom: "low2_4_loop1"
}
#batchnorm1_loop1_low3_4
layer {
name : "BN1_loop1_low3_4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop1_low3_4"
bottom: "inp_loop1_low3_4"
}
#relu1_loop1_low3_4
layer {
name : "ReLU1_loop1_low3_4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop1_low3_4"
bottom : "BN1_loop1_low3_4"
}
#conv1_loop1_low3_4
layer {
name : "Convolution1_loop1_low3_4"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop1_low3_4"
bottom : "ReLU1_loop1_low3_4"
}
#batchnorm2_loop1_low3_4
layer {
name : "BN2_loop1_low3_4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop1_low3_4"
bottom : "Convolution1_loop1_low3_4"
}
#relu2_loop1_low3_4
layer {
name : "ReLU2_loop1_low3_4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop1_low3_4"
bottom : "BN2_loop1_low3_4"
}
#conv2_loop1_low3_4
layer {
name : "Convolution2_loop1_low3_4"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop1_low3_4"
bottom : "ReLU2_loop1_low3_4"
}
#batchnorm3_loop1_low3_4
layer {
name : "BN3_loop1_low3_4"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop1_low3_4"
bottom : "Convolution2_loop1_low3_4"
}
#relu3_loop1_low3_4
layer {
name : "ReLU3_loop1_low3_4"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop1_low3_4"
bottom : "BN3_loop1_low3_4"
}
#conv3_loop1_low3_4
layer {
name : "Convolution3_loop1_low3_4"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop1_low3_4"
bottom : "ReLU3_loop1_low3_4"
}
#out_loop1_low3_4
layer {
name : "out_loop1_low3_4"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "low3_4_loop1"
bottom : "Convolution3_loop1_low3_4"
bottom : "inp_loop1_low3_4"
}
#up2_4_loop1
layer {
name: "up2_4_loop1" type: "Deconvolution"
bottom: "low3_4_loop1" top: "up2_4_loop1"
convolution_param {
kernel_size: 4 stride: 2
num_output: 512
pad: 1
weight_filler: { type: "bilinear" } bias_term: false
}
param { lr_mult: 0 decay_mult: 0 }
}
#low2_5_loop1
layer {
name: "low2_5_loop1"
type : "Concat"
bottom: "up2_4_loop1"
bottom: "up1_1_loop1"
top: "hg_loop1"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
}
#residual_loop1
#inp_residual_loop1
layer {
name : "inp_residual_loop1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_residual_loop1"
bottom: "hg_loop1"
}
#batchnorm1_residual_loop1
layer {
name : "BN1_residual_loop1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_residual_loop1"
bottom: "inp_residual_loop1"
}
#relu1_residual_loop1
layer {
name : "ReLU1_residual_loop1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_residual_loop1"
bottom : "BN1_residual_loop1"
}
#conv1_residual_loop1
layer {
name : "Convolution1_residual_loop1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_residual_loop1"
bottom : "ReLU1_residual_loop1"
}
#batchnorm2_residual_loop1
layer {
name : "BN2_residual_loop1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_residual_loop1"
bottom : "Convolution1_residual_loop1"
}
#relu2_residual_loop1
layer {
name : "ReLU2_residual_loop1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_residual_loop1"
bottom : "BN2_residual_loop1"
}
#conv2_residual_loop1
layer {
name : "Convolution2_residual_loop1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_residual_loop1"
bottom : "ReLU2_residual_loop1"
}
#batchnorm3_residual_loop1
layer {
name : "BN3_residual_loop1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_residual_loop1"
bottom : "Convolution2_residual_loop1"
}
#relu3_residual_loop1
layer {
name : "ReLU3_residual_loop1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_residual_loop1"
bottom : "BN3_residual_loop1"
}
#conv3_residual_loop1
layer {
name : "Convolution3_residual_loop1"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_residual_loop1"
bottom : "ReLU3_residual_loop1"
}
#out_residual_loop1
layer {
name : "out_residual_loop1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "residual_loop1"
bottom : "Convolution3_residual_loop1"
bottom : "inp_residual_loop1"
}
#lin_loop1
#conv1_lin_loop1
layer {
name : "Convolution_lin_loop1"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution_lin_loop1"
bottom : "residual_loop1"
}
#batchnorm_lin_loop1
layer {
name : "BN_lin_loop1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN_lin_loop1"
bottom: "Convolution_lin_loop1"
}
#relu_lin_loop1
layer {
name : "ReLU_lin_loop1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "lin_loop1"
bottom : "BN_lin_loop1"
}
#tmpout_loop1
layer {
name : "tmpout_loop1"
type : "Convolution"
convolution_param {
num_output: 16
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "tmpout_loop1"
bottom : "lin_loop1"
}
#tmpout_loop1_
layer {
name : "tmpout_loop1_"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "tmpout_loop1_"
bottom : "tmpout_loop1"
}
#ll_loop1_
layer {
name : "ll_loop1_"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "ll_loop1_"
bottom : "lin_loop1"
}
#loop2
#inter_loop2
layer {
name : "inter_loop2"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inter_loop2"
bottom : "inter_loop1"
bottom : "tmpout_loop1_"
bottom : "ll_loop1_"
}
#hg_loop2
#inp_loop2
layer {
name : "inp_loop2"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop2"
bottom: "inter_loop2"
}
#up1_1_loop2
#inp_loop2_up1_1
layer {
name : "inp_loop2_up1_1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "inp_loop2_up1_1"
bottom: "inp_loop2"
}
#batchnorm1_loop2_up1_1
layer {
name : "BN1_loop2_up1_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN1_loop2_up1_1"
bottom: "inp_loop2_up1_1"
}
#relu1_loop2_up1_1
layer {
name : "ReLU1_loop2_up1_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU1_loop2_up1_1"
bottom : "BN1_loop2_up1_1"
}
#conv1_loop2_up1_1
layer {
name : "Convolution1_loop2_up1_1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution1_loop2_up1_1"
bottom : "ReLU1_loop2_up1_1"
}
#batchnorm2_loop2_up1_1
layer {
name : "BN2_loop2_up1_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN2_loop2_up1_1"
bottom : "Convolution1_loop2_up1_1"
}
#relu2_loop2_up1_1
layer {
name : "ReLU2_loop2_up1_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU2_loop2_up1_1"
bottom : "BN2_loop2_up1_1"
}
#conv2_loop2_up1_1
layer {
name : "Convolution2_loop2_up1_1"
type : "Convolution"
convolution_param {
num_output: 128
kernel_size: 3
stride: 1
pad: 1
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution2_loop2_up1_1"
bottom : "ReLU2_loop2_up1_1"
}
#batchnorm3_loop2_up1_1
layer {
name : "BN3_loop2_up1_1"
type: "BatchNorm"
batch_norm_param {


}
top : "BN3_loop2_up1_1"
bottom : "Convolution2_loop2_up1_1"
}
#relu3_loop2_up1_1
layer {
name : "ReLU3_loop2_up1_1"
type : "ReLU"
relu_param {
negative_slope : 0
}
top : "ReLU3_loop2_up1_1"
bottom : "BN3_loop2_up1_1"
}
#conv3_loop2_up1_1
layer {
name : "Convolution3_loop2_up1_1"
type : "Convolution"
convolution_param {
num_output: 256
kernel_size: 1
stride: 1  
weight_filler {
type : "xavier"
}
bias_filler {
type : "constant"
value : 0
}
}
param {
lr_mult : 1
decay_mult : 1
}
param {
lr_mult : 2
decay_mult : 0
}

top : "Convolution3_loop2_up1_1"
bottom : "ReLU3_loop2_up1_1"
}
#out_loop2_up1_1
layer {
name : "out_loop2_up1_1"
type : "Concat"
data_param {
backend : LMDB
}
transform_param {
scale : 1
mirror : 0

}
top : "up1_1_loop2"
bottom : "Convolution3_loop2_up1_1"
bottom : "inp_loop2_up1_1"
}
#low1_pooling_1_loop2
layer {
name: "low1_pooling_1_loop2"
type: "Pooling"
bottom : "up1_1_loop2"
top: "low1_pooling_1_loop2"
pooling_param {
pool: MAX
kernel_size: 2
stride: 2
}
}
#low1_1_loop2
#batchnorm1_loop2_low1_1
layer {
name : "BN1_loop2_low1_1"
type: "BatchNorm"
